# git init - создание  подкатолога git,содержащий необходимые файлы  репозитория
# git clone -  клонирование репозитория из удаленного хранилища Git
# git add -  делает файлы отслеживаемыми, подготовка файла к фиксированию ( комитированию)
# git commit - фиксирование файла для  отправки в репозиторий git
# git push -  отправление коммита в удаленное хранилище
# git pull - скачивание из удаленного хранилища в локальное хранилище и обновление локал файлов
# git branch - создание ветки
# git checkout - переключение между ветками
# git merge - слияние веток
# git rebase - как и merge, только делает линейность ветки
# git cherry-pick - копирование коммита из одной ветки в другую с создание нового коммита
# git status - показывает файлы в ветке кроме зафиксированных(комиченых)
# git log - показывает зафикированные файлы в виде хеш-сумм и на какой ветке находимся
# git reset - отмена изменений
# git stash - откладывание изменений
# git diff - показывает различия между 2-мя наборами данных